v2206/solver_ADMFoam/multi_gasGenComparison/ADMFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    ".*(rho|rhoFinal)"
    {
        solver          diagonal;
    }

    "alpha.*"
    {    
        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          1;
    
        MULESCorr       true;
        nLimiterIter    1;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel; // GaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }
    
    // p_rgh
    // {
    //     solver          GAMG;
    //     tolerance       1e-06;
    //     relTol          0.1;
    //     smoother        GaussSeidel;

    //     // solver          PCG;
    //     // preconditioner  DIC;
    //     // tolerance       1e-07;
    //     // relTol          0.05;

    //     // solver          GAMG;
    //     // tolerance       1e-8;
    //     // relTol          0.01;
    //     // smoother        DICGaussSeidel;
    //     // nPreSweeps      0;
    //     // nPostSweeps     2;
    //     // cacheAgglomeration true;
    //     // nCellsInCoarsestLevel 10;
    //     // agglomerator    faceAreaPair;
    //     // mergeLevels     1;
    //     // // maxIter         100;
    // }

    // p_rghFinal
    // {
    //     $p_rgh;
    //     smoother        DICGaussSeidel;
    //     tolerance       1e-06;
    //     relTol          0;

    //     // solver          PCG;
    //     // preconditioner
    //     // {
    //     //     preconditioner  GAMG;
    //     //     tolerance       1e-6;
    //     //     relTol          0;
    //     //     nVcycles        2;
    //     //     smoother        DICGaussSeidel;
    //     //     nPreSweeps      0;
    //     //     nPostSweeps     2;
    //     //     nFinestSweeps   2;
    //     //     cacheAgglomeration true;
    //     //     nCellsInCoarsestLevel 10;
    //     //     agglomerator    faceAreaPair;
    //     //     mergeLevels     1;
    //     // };
    //     // tolerance       1e-9;
    //     // relTol          0;
    //     // // maxIter         300;
    // }

    // "pcorr.*"
    // {
    //     $p_rgh;
    //     relTol          0;
    // }
    
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-07;
        relTol          0;
    }

    "(k.*|epsilon.*|omega.*|Theta.*).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0;
    }
    
    "(T|Yi|S|G).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.0;

        // solver          PBiCGStab;
        // preconditioner  DILU;
        // tolerance       1e-6;
        // relTol          1e-6;
    }

}

PIMPLE
{
    momentumPredictor   false;
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;

    // pRefCell            0;
    // pRefValue           101300;
}
    
relaxationFactors
{
    fields {}
    equations
    {
        // ".*"            1;
        "(alpha.*|U)"   0.95;
    }
}


// ************************************************************************* //
