v2206/solver_ADMFoam/multi_gasGenComparison/ADMFoam/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid   1.0
    volScalarFieldValue alpha.gas      0.0
);

regions
(
    boxToCell
    {
        box (0 -0.04 0) (1 0.00 1);
        fieldValues
        (
            volScalarFieldValue alpha.liquid    0.0
            volScalarFieldValue alpha.gas       1.0  
        );
    }

    // boxToCell
    // {
    //     // box (0 -0.16 0) (1 -0.15 1);
    //     box (0 -0.16 0) (1 -0.1594 1);
    //     fieldValues
    //     (
    //         volScalarFieldValue T               319
    //     );
    // }

    // boxToCell
    // {
    //     box (0 0 0) (1 0.12 1);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.liquid   0.0
    //         volScalarFieldValue alpha.gas      1.0
    //     );
    // }

    // sphereToCell
    // {
    //     centre (0.02 0.02 0.0001);
    //     radius 0.003;
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.liquid   0.0
    //         volScalarFieldValue alpha.gas      1.0
    //     );
    // }
);


// ************************************************************************* //
